# HideReforWorkPlanes Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintParameters..::..HideReforWorkPlanes Property
PrintParameters Class See Also
---
Indicates whether to hide reference/work planes when printing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool HideReforWorkPlanes { get; set; }
```

Visual Basic
---
```text
Public Property HideReforWorkPlanes As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool HideReforWorkPlanes {
	bool get ();
	void set (bool value);
}
```

# See Also
PrintParameters Class
Autodesk.Revit.DB Namespace